22844/examples_new_ip/1060_create_cur.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:jour="http://journal.ws.spectrum" xmlns:xsd="http://model.ws.spectrum/xsd">
   <soap:Header/>
   <soap:Body>
      <jour:create>
         <jour:request>
            <xsd:operationEntity>
               <xsd:client>
                  <xsd:clientTypeEnum>0</xsd:clientTypeEnum>
                  <xsd:clientExtId>5555-90-siebel</xsd:clientExtId>
                  <xsd:clientIdSys>SBL_FR</xsd:clientIdSys>
                  <!--чтоб запрос в docsVision уходил-->
                  <xsd:icIssueAutority>ПВО ОВД Таганского района города Москвы кп 772-118</xsd:icIssueAutority>
                  <xsd:icIssueDate>2005-09-06</xsd:icIssueDate>
                  <xsd:icNum>787878</xsd:icNum>
                  <xsd:icSeries>6969</xsd:icSeries>
                  <xsd:identityCardTypeId>21</xsd:identityCardTypeId>
                  <xsd:personFirstName>АНДРЕЙ</xsd:personFirstName>
                  <xsd:personPatronymic>ЮРЬЕВИЧ</xsd:personPatronymic>
                  <xsd:personSurname>БОРИСОВ</xsd:personSurname>
                  <xsd:personCitizenCountryCode>643</xsd:personCitizenCountryCode>
                  <!--<xsd:personStatelessFlag></xsd:personStatelessFlag>-->
               </xsd:client>
               <xsd:deptCode>1126</xsd:deptCode>
               <!--<xsd:operJournalStatusEnum>3</xsd:operJournalStatusEnum>-->
               <!--комиссия-->
               <xsd:extFee>
                  <xsd:currency>USD</xsd:currency>
                  <xsd:summa>20</xsd:summa>
               </xsd:extFee>
               <xsd:documents>
                  <xsd:analyticAttributes>
                     <!--КБО-->
                     <xsd:code>CBO_CODE</xsd:code>
                     <xsd:value>711210-00</xsd:value>
                  </xsd:analyticAttributes>
                  <xsd:creditSumma>
                     <xsd:currency>USD</xsd:currency>
                     <xsd:summa>100</xsd:summa>
                  </xsd:creditSumma>
                  <xsd:creditAccountEntity>
                     <xsd:accountIdSys>99995</xsd:accountIdSys>
                     <xsd:accountNum>40817840101004055412</xsd:accountNum>
                     <xsd:deptCode>1056</xsd:deptCode>
                  </xsd:creditAccountEntity>
                  <xsd:debitSumma>
                     <xsd:currency>USD</xsd:currency>
                     <xsd:summa>100</xsd:summa>
                  </xsd:debitSumma>
                  <xsd:description>Внесение наличных на банковский счет
                   На основании: договор No 40817840101004055412</xsd:description>
                  <xsd:docNumber>1488</xsd:docNumber>
               </xsd:documents>
               <xsd:login>O1126</xsd:login>
               <!--пока по текущей реализации - табельник в ТП, логин бисквита или логин в AD-->
               <xsd:idSys>99995</xsd:idSys>
               <xsd:operJournalExtId>SP.CONP.1455566902</xsd:operJournalExtId>
               <xsd:operationCode>1060</xsd:operationCode>
               <!--<xsd:operationRegDate>2020-01-17T10:00:00</xsd:operationRegDate>-->
               <!--нет необходимости передавать-->
            </xsd:operationEntity>
            <xsd:requestInfo>
               <xsd:messageId>14881402</xsd:messageId>
            </xsd:requestInfo>
         </jour:request>
      </jour:create>
   </soap:Body>
</soap:Envelope>